{
    "tags": {
        "age progression": "Description: A person rapidly becomes older.",
        "age regression": "Description: A participant rapidly becoming younger. Instantaneous changes do not qualify.",
        "ahegao": "Description: An exaggerated facial expression indicating pleasure, usually includes rolled-up eyes, open mouth, and tongue sticking out. Often occurs during sexual climax.",
        "all the way through": "Description: Something passes through a person's body from the mouth to a rear orifice or vice versa. Very likely done by a large insertion or a tentacle.",
        "already uploaded": "Description: (See Expunging Reasons)",
        "amputee": "Description: A person missing one or more limbs. May invoke the guro tag.",
        "anal": "Description: Penetrating the anus. Any method is acceptable (sex toys, tentacles, etc.)",
        "angel": "Description: Having large, typically white wings. Usually possess a halo as well.",
        "anthology": "Description: A complete book of works by multiple authors. Doujinshi anthologies with a shared theme use goudoushi instead.",
        "apron": "Description: A garment often worn for protection while cooking. Usually worn with nothing else for erotic purposes.",
        "armpit licking": "Description: The act of licking a participant's armpit. Not acceptable for just licking the arms.",
        "armpit sex": "Description: The use of the armpit area to stimulate a penis.",
        "asphyxiation": "Description: The intentional restriction of oxygen to the brain, often for sexual arousal.",
        "assjob": "Description: Rubbing a penis between butt cheeks.",
        "aunt": "Description: Any sexual situation between a female and her niece(s) / nephew(s).",
        "autofellatio": "Description: Performing oral sex on oneself.",
        "bald": "Description: A head that has little or no hair on the scalp.",
        "ball sucking": "Description: The use of the mouth on testicles for pleasure.",
        "bandages": "Description: Strips of cloth or similar materials are wrapped around and visible on over at least 10% of a person's body.",
        "bbm": "Description: A fat man. Must have folds in midriff.",
        "bbw": "Description: A fat woman. Must have folds in midriff.",
        "bdsm": "Description: A type of lifestyle where at least one partner is dominant and at least one other is submissive. Does not necessitate the bondage or torture tags, but may lead to either or both.",
        "beauty mark": "Description: A dark facial mole, typically near the eyes. Does not include decorative facial add-ons such as a bindi, piercings, tattoos, or seals.",
        "bestiality": "Description: A human having sex with an animal or insect.",
        "big areolae": "Description: Noticeably large area surrounding the nipples. Should be at least 1/3 of the breast's surface area to qualify.",
        "big ass": "Description: Noticeably wide or large buttocks.",
        "big balls": "Description: Abnormally large testicles. A ball being at least as big as a hand suffices.",
        "big breasts": "Description: Generally large breasts. Each breast should be at least as big as the person's head consistently. For Cosplay this requires D cups or larger.",
        "big clit": "Description: Abnormally large clitorises.",
        "big lips": "Description: Abnormally large mouth lips. A lip's height must exceed that of the person's eye to qualify.",
        "big nipples": "Description: Big nipples that's long enough to be gripped in one hand.",
        "big penis": "Description: An unusually large penis, must be at least as big as its owner's forearm.",
        "bike shorts": "Description: Short, elastic, skin-tight legwear (but worn more as an undergarment) designed to improve comfort while cycling.",
        "bikini": "Description: Two-piece swimwear that covers genitalia and breasts. The two pieces can be connected with strings (a.k.a. slingshot bikini), but are more commonly completely split apart.",
        "birth": "Description: The act of a live creature being born. Usually preceded by pregnant.",
        "bisexual": "Description: A participant that engages in sexual activities with both the same and opposite genders.",
        "blackmail": "Description: The act of forcing others into providing sexual favors through threat or disclosing information.",
        "blindfold": "Description: An eye-cover meant to disable a person's sight.",
        "blood": "Description: The depiction of a lot of blood such as from a bodily wound.",
        "bloomers": "Description: Gym garment primarily for Japanese schoolgirls. Typically blue or red.",
        "blowjob face": "Description: Elongating the lips and mouth area in a tube-like fashion over the penis or object during a blowjob.",
        "blowjob": "Description: Sex involving the mouth and penis.",
        "body modification": "Description: Altering parts of the body in some artificial way, such as with non-organic augmentations, body part addition or removal, and unusual body part placement.",
        "body swap": "Description: Switching bodies with another participant.",
        "body writing": "Description: Various words or drawings made on the person's body, usually include derogatory terms such as \"slut\" or \"cum dumpster\".",
        "bodysuit": "Description: Any full-body suit that is form-fitting; must cover the arms and legs.",
        "bondage": "Description: The act and art of being tied up or bound.",
        "brain fuck": "Description: Sex involving the brain.",
        "breast expansion": "Description: Any significant increase in the size of breasts. Very likely to invoke big breasts and possibly huge breasts.",
        "breast feeding": "Description: Sucking on the breast directly. Does not require any milk to be visible.",
        "bride": "Description: A person wearing a wedding gown.",
        "brother": "Description: Any sexual situation between male siblings.",
        "bukkake": "Description: The act of being covered in cum, often by more then one person.",
        "bunny boy": "Description: Male version of bunny girl.",
        "bunny girl": "Description: Bunny ears, occasionally also a puffy tail.",
        "business suit": "Description: A person dressed in business attire.",
        "butler": "Description: A domestic worker, often serving rich families in large households. Wears a tuxedo with a tie or bowtie.",
        "c77":"Description: The work was sold at the 77th comiket",
        "c78":"Description: The work was sold at the 78th comiket",
        "c79":"Description: The work was sold at the 79th comiket",
        "c80":"Description: The work was sold at the 80th comiket",
        "catboy": "Description: Male version of catgirl.",
        "catfight": "Description: Uncoordinated fighting between two females.",
        "catgirl": "Description: Has the ears and often has a tail or other features of a cat.",
        "cbt": "Description: Cock and ball torture. Acts meant to torture the penile area in any way.",
        "cervix penetration": "Description: The cervix/womb of a female is visibly penetrated. Very likely invoked in conjunction with the x-ray tag.",
        "chastity belt": "Description: A locking item of clothing designed to prevent sexual intercourse or masturbation. Sometimes paired with bdsm.",
        "cheating": "Description: A significant other having sex with someone other than their partner.",
        "cheerleader": "Description: Cheerleader uniforms, usually with short skirts and matching accessories.",
        "chikan": "Description: The act of fondling or touching another person in a sexual manner. Rarely consensual and often takes place on a train or a bus.",
        "chinese dress": "Description: A body-hugging one-piece dress usually with a simple or floral pattern.",
        "chloroform": "Description: Any substance being used to render someone unconscious without physical force. Likely leads to rape and sleeping.",
        "christmas": "Description: Clothing often associated with Santa Claus that involves prominent use of red fabric and white trim edges.",
        "clit growth": "Description: Growth of the clitoris, often results in a big clit.",
        "clothed female nude male": "Description: A male has his genitalia fully exposed to a non-nude female.",
        "clothed male nude female": "Description: A female has her genitalia fully exposed to a non-nude male.",
        "clothed paizuri": "Description: The act of paizuri being preformed while clothing covers a significant proportion of the breasts. Must cover nipples and areola completely.",
        "coach": "Description: An instructor of a physical discipline.",
        "collar": "Description: A garment that fastens around or frames the neck. Often worn during bdsm or petplay activities and may include a leash.",
        "compilation": "Description: The gallery is a compilation of works not permitted together. See Expunging Reasons for details.",
        "condom": "Description: A plastic wrapper meant to protect the user and partner from unwanted STDs as well as pregnancy.",
        "coprophagia": "Description: Consuming feces.",
        "corruption": "Description: Corrupting a participant's mind forcefully with magic or other supernatural powers, robbing them of their purity.",
        "corset": "Description: A garment worn to hold and shape the torso, typically into an hourglass figure.",
        "cosplaying": "Description: A participant dressing up as another character from a parodied series. Does not include generic cosplay such as school, nurse, or maid uniforms.",
        "cousin": "Description: Any sexual situation between cousins.",
        "cowgirl": "Description: Has cow ears, horns, and possibly a tail and cowbell. May have a Holstein pattern (white with black splotches). Often paired with big breasts.",
        "crossdressing": "Description: Usually men in women's clothing, but may also be the other way around. For the latter, it should only be tagged if there's a clear intent to make the woman dress like a guy.",
        "crotch tattoo": "Description: Any noticeable patterns / emblems on the area between the lower abdomen and the crotch.",
        "cum swap": "Description: Exchanging already ejaculated semen between 2 or more participants.",
        "cumflation": "Description: The stomach area expands outward like a balloon due to being filled specifically with semen.",
        "cunnilingus": "Description: Orally stimulating the vagina to cause sexual arousal.",
        "dark nipples": "Description: Darker colored nipples, sometimes related to pregnancy.",
        "dark sclera": "Description: The whites of one's eyes being a dark color.",
        "dark skin": "Description: Brown or black skin tone.",
        "daughter": "Description: Any sexual situation between a parent and their female child.",
        "deepthroat": "Description: A blowjob in which the penis enters the throat.",
        "defloration": "Description: The act of a female losing their virginity. Frequently includes minor bleeding.",
        "demon girl": "Description: A female humanoid with a strong demonic appearance (wings, horns, pointed tail, skin patterns/markings, etc.) Occasionally also have abnormal skin color and eyes.",
        "demon": "Description: A male humanoid with a strong demonic appearance (wings, horns, pointed tail, skin patterns/markings, etc.) Occasionally also have abnormal skin color and eyes.",
        "diaper": "Description: A type of underwear used to defecate or urinate in discreetly; often worn by infants. Usually paired with age regression, scat, infantilism, or urination.",
        "dick growth": "Description: Abnormal growth of a penis. May result in a big penis.",
        "dickgirl on dickgirl": "Description: Any female with a penis having sex with another female with a penis. This includes shemales.",
        "dickgirl on male": "Description: A female with a penis penetrating a male, either anally or orally.",
        "dickgirls only": "Description: All sexual, fetishized, or intimate interactions in the gallery are strictly between dickgirls. Requires at least two dickgirls interacting.",
        "dilf": "Description: Any older man who appears to be within the age range of 30-50. Does not need to be a father.",
        "dog boy": "Description: Male version of dog girl.",
        "dog girl": "Description: A female with the tail and ears of a dog.",
        "dog": "Description: Any type of canine.",
        "double anal": "Description: Two penises inserted into the same anus.",
        "double blowjob": "Description: Two penises inserted into the same mouth.",
        "double penetration": "Description: Two orifices (mouth, vagina, or ass) being penetrated simultaneously. Very likely to invoke the group tag.",
        "double vaginal": "Description: Two penises inserted into the same vagina.",
        "dougi": "Description: The clothing typically worn for various martial arts classes and training. Usually a single color with a belt.",
        "doujinshi": "1.1 Doujinshi",
        "drill hair": "Description: Greatly curled / coiled hair appearing akin to vertical-winding or cone-shaped drills.",
        "drugs": "Description: Any chemical substance used to encourage promiscuity or pleasure.",
        "drunk": "Description: A participant is shown drinking prior or during sex. Should noticeably change their mood and/or actions. Often results in red cheeks, hazy or drugged eyes, and a more relaxed attitude towards sex.",
        "eggs": "Description: The act of having eggs inside oneself or laying them. Often invokes inflation.",
        "electric shocks": "Description: The use of electricity to cause pain or pleasure.",
        "elf": "Description: Has long, pointed ears and a typically slender body.",
        "emotionless sex": "Description: Showing no emotion from sexual activity.",
        "enema": "Description: Liquid or air injected into anus. May cause inflation.",
        "exhibitionism": "Description: Voluntary nudity or sexual activities with the risk of being seen by other individuals. Also blatant exposure to other individuals.",
        "eyemask": "Description: A covering for the area around the eyes which still leaves the rest of the face exposed.",
        "eyepatch": "Description: A piece of cloth or other material covering one eye.",
        "facesitting": "Description: Sitting on or over another participant's face. May be for partially smothering them or for oral contact with the anal/genital area. Sometimes paired with femdom or bdsm.",
        "facial hair": "Description: Noticeable hair on the chin, cheeks, or upper lip.",
        "fairy": "Description: A small humanoid with wings that are typically similar to those of an insect or butterfly.",
        "farting": "Description: Visible flatulence.",
        "father": "Description: Any sexual situation between a male and his son.",
        "females only": "Description: All sexual, fetishized, or intimate interactions in the gallery are strictly between females. Requires at least two females interacting.",
        "femdom": "Description: Female sexual domination. Typically over a male but can be over another female.",
        "feminization": "Description: A male has his lifestyle modified into that of a crossdresser (e.g. via training or mind control) or has his body altered into that of a shemale/futanari. In either case the person must act or be treated as more feminine.",
        "ffm threesome": "Description: A threesome containing two females and a male.",
        "filming": "Description: The act of someone's sexual activities being visually recorded / broadcasted.",
        "fingering": "Description: The use of fingers to creating sexual pleasure.",
        "fishnets": "Description: Article(s) of clothing made of a material patterned with an open, diamond-shaped knit.  Must be visible over at least half of the torso or a bodily extremity (e.g. thigh, forearm, etc.)",
        "fisting": "Description: Insertion of a fist, usually into vagina or anus.",
        "foot licking": "Description: The use of a tongue on feet to cause arousal.",
        "footjob": "Description: Using feet to sexually stimulate another participant.",
        "forbidden content": "Description: (See Expunging Reasons)",
        "forniphilia": "Description: Using participants as furniture.",
        "fox girl": "Description: A girl with the ears and tail of a fox, often quite bushy and with dark tips. See fox boy for male version.",
        "freckles": "Description: Numerous small pigmentation spots in close proximity to each other on the surface of the skin. Usually found on the face, but can be anywhere on the body.",
        "frottage": "Description: The rubbing of two or more penises against one another.",
        "full censorship": "Description: Any form of censorship that covers nearly all or all of a participant's genital region.",
        "full color": "Description: All pages with content are colorized. A very limited number of non-colored illustrations are allowed as long as they are not story pages.",
        "fundoshi": "Description: A traditional Japanese undergarment, made from a length of cotton.",
        "furry": "Description: Anthromorphic animal characters with some human personalities or characteristics.",
        "futanari on futanari": "Description: Any female with a penis having sex with another female with a penis. This includes shemales.",
        "futanari on male": "Description: A female with a penis penetrating a male, either anally or orally.",
        "futanari": "Description: A participant with both a penis and a vagina.",
        "gag": "Description: Anything strapped onto someone's mouth, partially or fully plugging it. Almost always involves bondage.",
        "gaping": "Description: A vagina or anus that is visibly stretched after sex. Often caused by large insertions, fisting, big or huge penis.",
        "garter belt": "Description: A belt-like undergarment with clips used to hold up stockings.",
        "gender bender": "Description: A character's body changes gender from their usual one. May invoke transformation if it is shown as a sequence and not a sudden change. Possession of a person of the opposing gender also qualifies.",
        "ghost": "Description: Sex with a non-corporeal being.",
        "giantess": "Description: A female participant who tower over others. She should be able to hold a normal-sized person in one hand. Use environment cues to establish if a character is huge or small.",
        "girls only": "Description: All sexual, fetishized, or intimate interactions in the gallery are strictly between females. Requires at least two females interacting.",
        "glasses": "Description: Any framed, transparent eye-wear worn in front of both eyes to improve eyesight.",
        "gloves": "Description: Garment covering the palm and usually the fingers. Can extend up the arm as far back as the shoulder.",
        "gokkun": "Description: Drinking or swallowing semen.",
        "gothic lolita": "Description: A style of dark but frilly clothing.",
        "group": "Description: More than two participants engaged in sex simultaneously.",
        "guro": "Description: Graphic mutilation of something organic. Moderate blood or violence does not qualify.",
        "guys only": "Description: All sexual, fetishized, or intimate interactions in the gallery are strictly between males. Requires at least two males interacting.",
        "gyaru-oh": "Description: Various fashions used to appear as un-Japanese as possible, including artificial tans, bleached hair, heavy makeup, gritty clothing, etc.",
        "gyaru": "Description: Various fashions used to appear as un-Japanese as possible, including artificial tans, bleached hair, decorated nails, heavy makeup, false eyelashes, etc.",
        "gymshorts": "Description: Short gym pants, color and length may vary.",
        "hair buns": "Description: A large amount of head hair is gathered and secured into one or more rounded bundles.",
        "hairy armpits": "Description: Excessive hair a participant's underarm area. Must be enough to be at least a ball of hair.",
        "hairy": "Description: Noticeably high amount of pubic hair.",
        "handjob": "Description: Masturbating another participant's penis.",
        "harem": "Description: 1 person being courted by at least 3 others, all engaging in consensual sex simultaneously.",
        "hidden sex": "Description: Sexual acts occurring within the immediate presence of a third party but which goes unseen.",
        "horns": "Description: One or more horns on a humanoid's head.",
        "horse": "Description: Any type of non-striped equine.",
        "hotpants": "Description: Short made to emphasize buttocks and the legs.",
        "huge breasts": "Description: Abnormally large breasts. Must be at least double the size of the owner's head.",
        "huge penis": "Description: A massive penis; must be at least equal in length or girth to the torso of its owner.",
        "human cattle": "Description: Human beings kept as livestock, usually for milking and/or breeding. Often involves bondage.",
        "human on furry": "Description: Sexual activity between a humanoid and an anthropomorphic.",
        "human pet": "Description: Treating a participant as though they were a pet animal. Often involves a collar and possibly bdsm.",
        "humiliation": "Description: Non-consensually humiliating/degrading a person in a sexual manner in front of a non-participating audience.",
        "impregnation": "Description: The act of becoming pregnant.",
        "incest": "Description: Sex between family relatives, even those not related by blood.",
        "incomplete": "Description: Works that are not complete.",
        "inflation": "Description: The stomach area expands outward like a balloon. Often due to being filled with gasses, tentacles, eggs, liquids, or from vore or unbirth actions.",
        "insect": "Description: Any type of bug.",
        "inseki": "Description: Sex involving in-law, step, or adopted family relatives.",
        "inverted nipples": "Description: Nipples that are retracted inside the breasts. Often brought out via stimulation or pulling.",
        "josou seme": "Description: A crossdresser or tomgirl taking the lead / being dominant over a sexual partner.",
        "kemonomimi": "Description: A humanoid that has animal ears and often a tail but little-to-no other animal parts.",
        "kimono": "Description: Traditional Japanese garment with large ribbons and varying patterns.",
        "kissing": "Description: The act of two individuals pressing their lips together, possibly also moving their tongues into each others' mouths or sucking on them.",
        "kunoichi": "Description: Female ninja garment. Typically dark robes and/or fishnets with some light armor.",
        "lab coat": "Description: A long white coat. Very often worn by doctors, scientists, or school nurses.",
        "lactation": "Description: Breasts squirting liquids (usually milk).",
        "large insertions": "Description: The insertion of sex toys or other objects that seem unlikely to fit comfortably into the one receiving said object.",
        "large tattoo": "Description: A permanent marking / pattern on the skin, usually done with ink. Must be prominent enough to cover at least half a limb / face. Also acceptable for numerous small ones which cumulatively meet the same minimum.",
        "latex": "Description: Any clothing that is rubber or plastic-based, often skin-tight.",
        "layer cake": "Description: Penis rubbed between two vaginas. May involve alternating penetration between each vagina.",
        "leash": "Description: A strap, cord, or chain that is usually attached to a collar or is wrapped around the neck. Often involved in bdsm or petplay activities.",
        "leg lock": "Description: The use of both of one's legs to hold a sexual partner.",
        "leotard": "Description: Plastic clothing frequently used with gymnastics, bunny girls, and wrestling.",
        "lingerie": "Description: Skimpy or sexy undergarments that are worn to increase sex appeal; as opposed to regular undergarments. Also includes nightwear.",
        "living clothes": "Description: Clothing that moves on its own volition.",
        "lolicon": "Description: Underage girls in sexual situations or being nude. Not to be confused with young girls in general; should have undeveloped bodies.",
        "long tongue": "Description: A participant's tongue whose length should at least be able to extend from the mouth up to the participant's eyebrows.",
        "low bestiality": "Description: Indicates that the instance of bestiality does NOT pass the presence rule.",
        "low lolicon": "Description: Indicates that the instance of lolicon does NOT pass the presence rule.",
        "low shotacon": "Description: Indicates that the instance of shotacon does NOT pass the presence rule.",
        "machine": "Description: Sex with a mechanical structure.",
        "magical girl": "Description: A costume including a skirt and frilly uniform common in the genre.",
        "maid": "Description: A maid uniform which often consists of a dress or skirt of various lengths and an apron. A headband alone does not qualify.",
        "male on dickgirl": "Description: A male penetrating a penis wielding female, either anally, vaginally or orally. This includes shemales.",
        "male on futanari": "Description: A male penetrating a penis wielding female, either anally, vaginally or orally. This includes shemales.",
        "males only": "Description: All sexual, fetishized, or intimate interactions in the gallery are strictly between males. Requires at least two males interacting.",
        "manga": "1.1 Doujinshi",
        "masked face": "Description: An opaque mask fully covering a participant's face, usually to hide their identity. This includes typical balaclava-styled masks.",
        "masturbation": "Description: Self-pleasuring.",
        "mecha girl": "Description: A female wearing mechanical parts.",
        "metal armor": "Description: Metal armor worn during medieval or medieval fantasy era.",
        "miko": "Description: A shrine maiden; a young priestess. Usually wears red trousers or a long, red, slightly pleated skirt tied with a bow and a white haori (kimono jacket) with some white or red hair ribbons.",
        "milf": "Description: Any older woman who appears to be within the age range of 30-50. Does not need to be a mother.",
        "military": "Description: Any common military uniform such as camouflage or officer uniforms.",
        "milking": "Description: Pulling on breasts to excrete milk, either by hand or with a machine. Not for any penile pulling.",
        "mind break": "Description: Training / turning someone mentally into a sexual slave, typically through lengthy or rigorous sexual stimulation.",
        "mind control": "Description: Forcing a participant to do something on their own, but against their own will.",
        "minigirl": "Description: A hand-sized female. Use environment cues to establish if a character is small, or huge.",
        "miniguy": "Description: Male version of minigirl. Use environment cues to establish if a character is small, or huge.",
        "mmf threesome": "Description: A threesome containing two males and a female.",
        "monster girl": "Description: Anything that is not a human, alien, angel, robot, demon, animal, vampire, fairy, elf, or furry.",
        "monster": "Description: Anything that is not human, alien, angel, robot, demon, animal, vampire, fairy, elf, or furry.",
        "moral degeneration": "Description: Removing a person's moral standing towards sex. Must be done without the use of strong substances or supernatural influence. May invoke mind break.",
        "mosaic censorship": "Description: Any form of mosaic censorship that covers nearly all or all of a participant's genital region.",
        "mother": "Description: Any sexual situation between a female and her children.",
        "mtf threesome": "Description: A threesome containing one male, a transsexual (futanari or shemale) and a female.",
        "multi-work series": "Description: A complete work whose story spans across multiple volumes, books, or releases.",
        "multiple paizuri": "Description: More than one pair of breasts being used for paizuri regardless of number.",
        "multiple penises": "Description: Possessing more than one penis. Not for tentacle-style penises.",
        "muscle":"Description: A noticeably muscular participant.",
        "nakadashi": "Description: Ejaculate lingering inside any orifice besides a mouth. Usually includes an external pool of semen.",
        "nakadashi creampie": "Description: just means Creampie. Nakadashi is actually the japanese word used to express creampie, but the nakadashi tag is a bit stretched.",
        "netorare": "Description: Another person's spouse / partner being unfaithful and the one being cuckolded being aware of the situation. Also acceptable for when the story is clearly meant to invoke jealousy or sympathy on behalf of the person being cuckolded.",
        "niece": "Description: Any sexual situation between a female and her uncle/aunt.",
        "nipple fuck": "Description: Penetration of the nipples or breasts by a penile object.",
        "no penetration": "Description: No insertion of anything into a vagina, anus, or any other bodily opening. The mouth is the only exception.",
        "nose hook": "Description: A hook used hold one's nostrils open by pulling them upwards.",
        "nun": "Description: Wearing a typically black cloth robe with a habit as per the Roman Catholic order. May also be wearing a wimple, rosary, and a veil.",
        "nurse": "Description: Wearing the common white/pink outfit or scrubs, usually has a cap.",
        "oil": "Description: A participant is covered at least partially with a lubricant such as body oil to give their skin a sleek texture / glazed appearance.",
        "old man": "Description: A male of visibly old age, usually with facial wrinkles. If one had to estimate their age it should be at least 50.",
        "onahole": "Description: An artificial vagina used to masturbate a penis.",
        "oni": "Description: A humanoid with 1-2 horns on their head and possibly pointy ears. Does NOT have wings or a tail.",
        "oppai loli": "Description: A little girl with anything larger than small breasts.",
        "orc": "Description: Fantasy creature as tall as or a bit taller than human. Usually with sloping forehead, jutting jaw, prominent teeth, and coarse body hair.",
        "orgasm denial": "Description: Preventing someone from achieving an orgasm such as by tools.",
        "out of order": "Description: The content is not sorted sequentially; usually has a story.",
        "oyakodon": "Description: A grouping of a parent and one (or more) of their children engaging in sexual activity with the same partner simultaneously.",
        "paizuri": "Description: The act of thrusting a penis (or similar object) in between breasts.",
        "pantyhose": "Description: An often transparent single piece of undergarment capable of completely covering the legs and genital area.",
        "parasite": "Description: A small organism that infects the host, often to induce sexual stimulation. May count as possession on some occasions.",
        "pasties": "Description: Patches that cover nipples and areolae which are affixed with adhesive.",
        "pegging": "Description: A male being anally penetrated by a strap-on or sex toy.",
        "petrification": "Description: Becoming a statue/rock-like formation.",
        "phimosis": "Description: A very high degree of foreskin coverage on the penis. Should be almost fully covered even when it is erect.",
        "piercing": "Description: Any form of piercing besides those on the ears. Usually on the clitoris or nipples for rings to be placed.",
        "pig": "Description: Any animal in the genus sus.",
        "pillory": "Description: An often wooden enclosure or apparatus that specifically restricts the movement of the head and hands.",
        "piss drinking": "Description: Consuming urine.",
        "pixie cut": "Description: Short hair style where generally the top is brushed towards the face, the sides are cut short and do not reach below the ear while the back may reach down the neck.",
        "policewoman": "Description: Wears the typical police uniform. Usually has a badge, pouches on their shirt, and a gun holster. See policeman for male version.",
        "ponytail": "Description: A large amount of head hair is gathered and secured in one tail-shaped bundle at the back or side of the head and allowed to hang freely.",
        "poor grammar": "Description: Any 3rd party translation containing at least 10 grammatical or spelling errors per 40 pages.",
        "possession": "Description: A participant has their body taken over by an external mind, effectively being robbed of their own will.",
        "pregnant": "Description: Sexual activities or nudity involving a visibly pregnant participant.",
        "prolapse": "Description: Vaginal or anal walls distending out of their respective holes. Sometimes preceded by gaping.",
        "prostate massage": "Description: Rubbing the inner wall of the anus, near the testicles.",
        "prostitution": "Description: The act of soliciting sex in exchange for money. Typically involves dressing in certain provocative ways.",
        "pubic stubble": "Description: Shaved pubic area with visible hair stubble remaining.",
        "public use": "Description: A person remaining stationary and making themselves openly available for sex, often with multiple partners. Frequently involves them being used as a living toilet / urinal. May include or lead to body writing.",
        "randoseru": "Description: A backpack made from leather or leather-like synthetic material, most commonly used by elementary schoolchildren.",
        "rape": "Description: Forced or non-consensual sex.",
        "replaced": "Description: See Expunging Reasons",
        "rewrite": "Description: An individual has filled in their own text either in place of the original text or where there was none.",
        "rimjob": "Description: Orally stimulating an anus to cause sexual arousal.",
        "robot": "Description: A mechanical humanoid (e.g. cyborg, android, fembot). Typically has visible metallic body parts or limb joints.",
        "robot girl":"Description: A female wearing mechanical parts.\n This is the description for (mecha girl)",
        "ryona": "Description: Violence, fighting, or beatings. Usually at a level that does NOT necessitate the torture tag.",
        "saliva": "Description: The use of a fair amount of oral secretions for sexual purposes. Licking or spitting does not quality.",
        "scanmark": "Description: Images that are visibly marked by a translator/scanner/colorizer. Are subject to replacement by non-marked versions, should they exist.",
        "scar": "Description: Marks or burns on the skin. Must be very prominent.",
        "scat": "Description: Defecating (shitting).",
        "school swimsuit": "Description: A one-piece swimwear with no cover over any legs or arms typically used in schools in Japan. Usually blue or white and sometimes sporting a identity card on the chest.",
        "schoolboy uniform": "Description: Male version of schoolgirl uniform.",
        "schoolboy": "Description: Male version of schoolgirl uniform.",
        "schoolgirl uniform": "Description: A person wearing a sailor or otherwise standard school uniform.",
        "schoolgirl": "Description: A person wearing a sailor or otherwise standard school uniform.",
        "selfcest": "Description: Sex between two different versions of the same person. Usually between someone and their genderbent counterpart.",
        "sex toys": "Description: Any kind of toy that is used for sexual purposes.",
        "shared senses": "Description: Situation where someone shares their senses with something or someone else.",
        "shemale": "Description: Girls that have male genitals but not a vagina.",
        "shibari": "Description: A method of artistic rope tying around the torso to create visually distinctive patterns.",
        "shimapan": "Description: Short for shima pantsu, meaning striped panties.",
        "shotacon": "Description: Underage boys in sexual situations or being nude. Not to be confused with young men in general; should have undeveloped bodies.",
        "shrinking": "Description: A participant becoming smaller. May lead to minigirl or miniguy. Does not necessitate transformation.",
        "sister": "Description: Any sexual situation between a female and her sibling(s).",
        "slave": "Description: Forcing a participant being into servitude for sexual purposes. If this is voluntary use bdsm instead.",
        "sleeping": "Description: Sex with someone who is not awake. May count as rape depending on the context.",
        "slime": "Description: Any gooey / gelatinous substances involved sexually. A slime-based creature necessitates both this and the monster tag.",
        "small breasts": "Description: Must be small enough to reasonably call the girl \"flat\".",
        "small penis": "Description: An unusually petite penis; must be smaller than its owner's index finger. For shotacon use the pinky finger.",
        "smegma": "Description: The presence of various matter that collects in moist areas between the glans penis and the foreskin or around the clitoris and labia minora.",
        "smell": "Description: The act of emitting strong, sensational smells.",
        "smoking": "Description: A substance, usually tobacco, is burned and the fumes are tasted or inhaled during sex.",
        "snake girl": "Description: Any variation of a serpent-female hybrid.",
        "snuff": "Description: A participant being visibly killed.",
        "sole dickgirl": "Description: Only a single futanari or shemale participates in all sexual or fetishized activities throughout the gallery.",
        "sole female": "Description: Only a single female participates in any sexual or fetishized activities throughout the gallery (but not necessarily in every activity).",
        "sole male": "Description: Only a single male participates in any sexual or fetishized activities throughout the gallery (but not necessarily in every activity).",
        "solo action": "Description: One character engages in a sexual activity by themselves. The use of objects as stimulus is acceptable (e.g. magazines, sex toys, exhibitionism). Other characters may be present, but no physical or mental interaction may occur.",
        "spanking": "Description: Spanking someone's butt as torture or for sexual pleasure.",
        "squirting": "Description: A female ejaculating strongly.",
        "stockings": "Description: An often transparent stretchy garment covering the foot and lower part of the legs but does not reach to the genital area.",
        "stomach deformation": "Description: A solid object pushes against the stomach from the inside and creates a visible protrusion. Often caused by large insertions or a big penis.",
        "story arc": "Description: A story spawning multiple chapters within a single gallery.",
        "strap-on": "Description: An attachable dildo. Very likely to be part of either pegging or yuri.",
        "stuck in wall": "Description: Someone stuck in a lengthy surface, unable to move, often with genitalia or other non-limb body parts hanging out.",
        "sumata": "Description: Sex using the thighs to stimulate a penile object.",
        "sundress": "Description: An informal dress of a lightweight fabric, usually loose fitting, worn without a layering top.",
        "sunglasses": "Description: Any framed, non-transparent eye-wear used to improve sight in sunlight.",
        "sweating": "Description: Numerous sweat drops on a participant's body.",
        "swimsuit": "Description: An outfit worn specifically for swimming or other water-based activities, typically covering the entire torso.",
        "swinging": "Description: A couple allowing one or both partners to have sex with a third party.",
        "syringe": "Description: A tool consisting of a tube, a plunger, and a attached needle. Is used to inject participants with different kinds of liquids or gases.",
        "tail plug": "Description: Any kind of tail sex toy.",
        "tail": "Description: One or more prominent flexible appendages, part of the body, typically protruding from the rear of the torso. Bodies without legs do not qualify.",
        "tall girl": "Description: A noticeably tall woman. Should appear to be at least a full head taller than her partner. Use environmental cues if no partner exists.",
        "tall man": "Description: A noticeably tall man. Should appear to be at least a full head taller than his partner. Use environmental cues if no partner exists.",
        "tankoubon": "Description: A complete book by a single artist published by a third party. Primarily only in the Manga or Non-H categories.",
        "tanlines": "Description: Lighter lines, usually from clothes, after having become tanned.",
        "teacher": "Description: A participant who is known as an educator of multiple students, typically in a school setting.",
        "tentacles": "Description: Long and flexible tendrils used for sexual purposes.",
        "thick eyebrows": "Description: Having eyebrows at least as thick as the owner's finger.",
        "thigh high boots": "Description: Boots that reach up past the knee.",
        "tiara": "Description: Semi-circular ceremonial headband, style may differ but placed in close proximity to forehead. Often worn by a monarchs and magical girls.",
        "tickling": "Description: Touching the body in a manner that causes involuntary twitching movements or laughter. Usually done with a feather.",
        "tights": "Description: Tight clothing often worn by western superheroes. Can be both for the legs and the body.",
        "time stop": "Description: Time stops or is altered for at least one participant while another takes sexual advantage of the situation.",
        "tomboy": "Description: A girl who dresses, acts, and speaks in a boyish manner but not to hide her gender, usually wearing shorts and t-shirts. May co-exist with crossdressing but only if the girl is  trying to conceal her gender.",
        "tomgirl": "Description: A male whose appearance causes a casual observer to easily mistake them for a female (e.g. longer hair, thinner/more delicate features, rounder eyes/lips). Likely to have a shy, submissive, or passive disposition (e.g. blushing). Often involves m:crossdressing.",
        "torture": "Description: Techniques of various kinds being used to inflict pain or unwanted stimuli.",
        "tracksuit": "Description: Matching shirt and pants made from synthetic materials meant to induce sweating whilst used in exercise or sports. Only one part of the outfit needs to be left on during sex.",
        "transformation": "Description: A sequence showing a physical, biological change of some kind.",
        "tribadism": "Description: Sex involving women rubbing their vulvae against each other. Very likely to invoke yuri.",
        "triple penetration": "Description: Three insertions occurring to one person simultaneously. Combinations are often a double penetration with the remaining orifice also penetrated, or a double vaginal / double anal with the other rear orifice penetrated.",
        "ttf threesome": "Description: A threesome containing two transsexuals (futanari or shemale) and a female.",
        "ttm threesome": "Description: A threesome containing two transsexuals (futanari or shemale) and a male.",
        "tutor": "Description: A person giving private academic assistance to a student outside of school.",
        "twins": "Description: A pair of relatively identical looking siblings having sex with third person or each other. Likely to invoke the group and shimaidon tags.",
        "twintails": "Description: A large amount of head hair is gathered and secured in two tail-shaped bundles at opposing sides of the head and allowed to hang freely.",
        "unbirth": "Description: A participant being consumed by a vagina. Essentially birth in reverse (and thus does NOT necessitate it or the pregnant tag).",
        "uncensored": "Description: Either published uncensored or later decensored, the gallery is not censored at any point.",
        "underwater": "Description: Participants are mostly or completely submerged in liquid during sex.",
        "unusual pupils": "Description: Pupils being or containing odd shapes such as hearts or stars.",
        "unusual teeth": "Description: Having teeth that are very sharp, buck, gaped, or missing.",
        "urethra insertion": "Description: Introduction of anything into the tube from which urine exits the body.",
        "urination": "Description: Peeing.",
        "vampire": "Description: Has pointy teeth and drinks blood. Must be shown using vampiric abilities or baring their fangs.",
        "virginity": "Description: A male engaged in sexual activity is stated to be a virgin during the same scene.",
        "vomit": "Description: Regurgitation of stomach contents through the mouth or nose.",
        "vore": "Description: Being swallowed whole via the mouth.",
        "voyeurism": "Description: Spying on participants who are engaged in sexual behavior, stripping, or are in the washroom.",
        "waitress": "Description: A uniform worn by a girl working in a restaurant; often light-colored dress, sometimes including an apron or skirt.",
        "webtoon": "Description: Any webcomic published online formatted in a vertical layout, utilizing whitespace instead of or alongside paneling.",
        "whip": "Description: A tool for lashing or striking an animal or a person to inflict a moderate amount of pain. The use of any sexual object in this manner also counts. Highly likely to involve bdsm.",
        "widow": "Description: A woman whose significant other (married or in a long term relationship) has died. The deceased and their death need to be clearly established in the gallery itself either verbally or visually.",
        "wings": "Description: Any prominent wings on a humanoid.",
        "witch": "Description: A tall pointed hat with a wide brim and usually cloth robes.",
        "wolf girl": "Description: Has the pointed ears and often a bushy tail or other features of a wolf.",
        "wormhole": "Description: One or more objects that connects two distant locations. Often shown as a form of \"mobile glory hole\" where a male or female makes their respective genitalia available through the wormhole.",
        "wrestling": "Description: Full-bodied fighting involving grappling and holding between at least two participants.",
        "x-ray": "Description: Internal organs being visible through the skin or from the inside.",
        "yandere": "Description: Psychotic behaviour motivated by obsessive love. This includes stalking or abducting the person of interest or intimidating or hurting perceived rivals. If there are any sexual activities the crazed participant must be directly involved in them at some point.",
        "yaoi": "Description: Sex between at least two males. Also permitted for any male-only galleries meant to have the same appeal.",
        "yuri": "Description: Sex between at least two females.",
        "zombie": "Description: A fleshy undead creature."
    }
}
